Revit 2027 API
ConnectorElement.CreateElectricalConnector Method
Overload List
Name | Description
CreateElectricalConnector(Document, ElectricalSystemType, Reference) |  Create a new electrical ConnectorElement.
CreateElectricalConnector(Document, ElectricalSystemType, Reference, Edge) |  Create a new electrical ConnectorElement.
Top
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace